tutorial/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
    
    airToCopper
    {
        type            fixedValue;
        value           uniform 330;
    }
        
    "(left|right)"
    {
        type            slip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
