tutorial/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.0489);

boundaryField
{
    
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0.0489);
    }
    
    top
    {
        type            zeroGradient;
    }
    
    airToCopper
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    "(left|right)"
    {
        type            slip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
