tutorial/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{

    bottom
    {
        type            zeroGradient;
    }
    
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    airToCopper
    {
        type            zeroGradient;
    }
    
    "(left|right)"
    {
        type            slip;
    }
    
    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
