tutorial/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default 	     cellLimited leastSquares 1;
    grad(U) 	     cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwindV grad(U);
    div(phi,h)      Gauss linearUpwind grad(h);

    div(phi,k)      Gauss upwind;
    div(phi,omega) Gauss upwind;

    div(phiv,p)     Gauss linear;
    div(phi,K)      Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
